

// memo写法

// switch 写法


// 字符转数字


// 万能头文件


// 哈希链表LRU

// 初始化

// 二叉树写法


// 判断是否是int


//字符串处理


// 依次取出vector元素，手写iter


// 栈用法

// 初始int为极大值

// 三个数中取min

// 降序排列vector

// 将bool的数组转为memo的哈希表，需要转为string：

//stringstream用法


//优先级队列

// 二维vector自定义排序

//直接定义数组，删除new的数组

// 定义二维数组

// 定义二维数组（非stl）


// 定义一维数组（非stl）


// 动态数组

//set集合


// 建立哈希映射


// deque记录结果

//二叉树, 找最大值作为root

// hashset定义


// 字符串拼接


//翻转字符串


//字符串转为列表

// 数据很大的时候，数据的类型定义（存在溢出）

// 二叉树搜索目标

// 插入节点


// 洗牌算法


// 原地数组交换

// 二叉堆的接口

// 多叉树的遍历

//找pq的最近公共父节点


// 迭代字典


// 截取string的部分


// 匹配字符串

// 按方向递归二维数组

// char的写法 


// 写判断0<x<5的while


// 快速排序的swap

















